# -----------------------------
# 1. نبدأ من صورة Python جاهزة
# -----------------------------
FROM python:3.10-slim

# -----------------------------
# 2. تعيين بيانات وصفية
# -----------------------------
LABEL maintainer="Ahmed Zaki" \
      version="1.0" \
      description="تعليمي - Flask app داخل Docker"

# -----------------------------
# 3. تعيين متغير بيئة
# -----------------------------
ENV PYTHONUNBUFFERED=1

# -----------------------------
# 4. تحديد مجلد العمل داخل الـ container
# -----------------------------
WORKDIR /app

# -----------------------------
# 5. نسخ الملفات من جهازك للـ image
# -----------------------------
COPY requirements.txt .

# -----------------------------
# 6. تثبيت المتطلبات
# -----------------------------
RUN pip install --no-cache-dir -r requirements.txt

# -----------------------------
# 7. نسخ باقي ملفات المشروع
# -----------------------------
COPY . .

# -----------------------------
# 8. توثيق المنفذ المستخدم
# -----------------------------
EXPOSE 5000

# -----------------------------
# 9. تحديد الأمر الافتراضي للتشغيل
# -----------------------------
CMD ["python", "app.py"]

